{"keras_version": "2.0.5", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "name": "conv2d_1", "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 32, "batch_input_shape": [null, 32, 32, 3], "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "activation": "relu", "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "name": "conv2d_2", "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 32, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "activation": "relu", "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "bn_1", "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "maxpool2d_1", "trainable": true, "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dp_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "name": "conv2d_3", "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 64, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "activation": "relu", "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "name": "conv2d_4", "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 64, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "valid", "activation": "relu", "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "bn_2", "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "maxpool2d_2", "trainable": true, "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dp_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "name": "fc_1", "units": 128, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "name": "fc_2", "units": 128, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "name": "bn_3", "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "maxpool2d_3", "trainable": true, "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dp_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "fln_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "name": "fc_3", "units": 512, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dp_4", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "name": "fc_4", "units": 43, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "softmax", "activity_regularizer": null}}]}